Управление_по_целям_и_KPI/src/Catalogs/KPI_ИнформационныеБазы/KPI_ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_ИнформационныеБазы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
  </predefined>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИБНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindows</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/Catalogs/KPI_ИнформационныеБазы/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура Проверить(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВерсияПлатформы", Объект.ВерсияПлатформы);
	СтруктураПараметров.Вставить("ТипИБ", Объект.ТипИБ);
	СтруктураПараметров.Вставить("КаталогИБ", Объект.КаталогИБ);
	СтруктураПараметров.Вставить("ИмяСервераИБ", Объект.ИмяСервераИБ);
	СтруктураПараметров.Вставить("ИмяИБНаСервере", Объект.ИмяИБНаСервере);
	СтруктураПараметров.Вставить("АутентификацияWindows", Объект.АутентификацияWindows);
	СтруктураПараметров.Вставить("ПользовательИБ", Объект.ПользовательИБ);
	СтруктураПараметров.Вставить("ПарольИБ", Объект.ПарольИБ);
	
	KPI_ОбщегоНазначения.ПроверитьСоединение(СтруктураПараметров);
КонецПроцедуры




&НаКлиенте
Процедура ТипИБПриИзменении(Элемент)
	ПоказатьПараметрыПодключения();
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПараметрыПодключения()
	Если Объект.ТипИБ Тогда
		Элементы.КаталогИБ.Видимость = Ложь;
		Элементы.ИмяСервераИБ.Видимость = Истина;
		Элементы.ИмяИБНаСервере.Видимость = Истина;
	Иначе 
		Элементы.КаталогИБ.Видимость = Истина;
		Элементы.ИмяСервераИБ.Видимость = Ложь;
		Элементы.ИмяИБНаСервере.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура АутентификацияWindowsПриИзменении(Элемент)
	Элементы.ПользовательИБ.Доступность = Не Элементы.ПользовательИБ.Доступность;
	Элементы.ПарольИБ.Доступность = Не Элементы.ПарольИБ.Доступность;
	Объект.ПарольИБ = "";
КонецПроцедуры


&НаКлиенте
Процедура КаталогИБНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	
	Если ДиалогОткрытия.Выбрать() Тогда
		Объект.КаталогИБ = ДиалогОткрытия.Каталог;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Предопределенный Тогда
		Сообщить("Запрещено изменять предопределенный элемент справочника");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПоказатьПараметрыПодключения();
КонецПроцедуры
